{
    "info": {
        "name": "Vlad Kouzin",
        "slogan": "A great simplifier of all things technology based",
        "email": "vkouzin@outlook.com",
        "number": "831 582-8604"
    },
    "summary": "Highly motivated and experienced software engineer seeking a remote position to leverage my skills in solving complex problems with simple, efficient solutions. Passionate about contributing to a team that values innovation, quality, and growth.",
    "positions": [
        {
            "title": "Full Stack Developer",
            "company": "AlertMedia",
            "website": null,
            "period": "05/2022 - 08/2023",
            "location": "Remote",
            "description": "Application and cli tools development, refactoring, and various other tasks.",
            "achievements": [
                "Refactored Docker Compose configurations for local development, designing a clear framework for maintaining and adding new services",
                "Migrated Bitbucket pipelines to and advanced CircleCI configuration, reducing pipelines run time from over an hour to 7 minutes",
                "Developed multiple web application to improve visibility into our deployment process and the state of various environments deployed to AWS",
                "Developer multiple CLI tools for local development in order to automate new user setup and run Bitbucket pipelines locally"
            ]
        },
        {
            "title": "Full Stack Developer",
            "company": "Chili Piper",
            "website": null,
            "period": "02/2021 - 05/2022",
            "location": "Remote",
            "description": "Built Chrome extensions, internal support portals, and customer-facing tools.",
            "achievements": [
                "Built a unique Chrome extension for our Customer Love team, reducing response times and increasing customer satisfaction",
                "Build an internal support portal allowing our Customer Success team to dig deeper into customer accounts without the needs to learn a query language",
                "Built and maintained customer-facing tools and add-ons to expand the feature set of Chili Piper to meet niche requirements of our high profile customers",
                "Maintained a server to host all the custom code and projects using Docker, Kubernetes, and Helm"
            ]
        }
    ],
    "skills": {
        "Technologies": [
            "Go",
            "TypeScript",
            "React",
            "Svelte",
            "NodeJS",
            "Deno"
        ],
        "Software": [
            "Docker",
            "Kubernetes",
            "Terraform",
            "Firebase",
            "CircleCI",
            "BitBucket",
            "Jira",
            "Confluence",
            "AWS",
            "GCP"
        ]
    }
}